DataFrame (df) is a 2-dimensional labeled data structure provided by Pandas in Python. It’s similar to a table or a spreadsheet, where data is organized in rows and columns.

Each column can have different data types (numeric, string, boolean, etc.), and each row represents an observation or entry.

Key Features of a DataFrame:
Rows: Represent individual records or data points.

Columns: Represent different features or attributes of the data.

Index: Each row is labeled with an index (by default, it starts with numbers from 0 to n-1).

Why We Use DataFrames:
DataFrames are extremely useful for handling structured data. They make it easy to manipulate, clean, analyze, and visualize datasets.

pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.
Dataframe : Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Example of a DataFrame
Let’s consider an example of a DataFrame for a list of students:

Index	Name	Age	Grade
0	Alice	22	A
1	Bob	23	B
2	Charlie	22	A
3	David	24	C
In code, you can create this DataFrame with Pandas:

In [3]:
import pandas as pd
import numpy as np
# Create a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [22, 23, 22, 24],
    'Grade': ['A', 'B', 'A', 'C']
}

df = pd.DataFrame(data)
# Create a DataFrame from a dictionary

# Display the DataFrame
print(df)

      Name  Age Grade
0    Alice   22     A
1      Bob   23     B
2  Charlie   22     A
3    David   24     C

In the code:

df refers to the DataFrame object.

df.head() shows the first 5 rows of the DataFrame (you can specify a different number inside head()).

df.shape gives the dimensions (rows, columns) of the DataFrame

Common DataFrame Operations:
Accessing a column: df['Age'] will give you the Age column.

Filtering rows: df[df['Grade'] == 'A'] filters all rows where the grade is 'A'.

Adding a column: df['Passed'] = df['Grade'] != 'C' adds a new column based on the condition.
This adds a new boolean column Passed where True means the student did not get a 'C' grade.

Dropping a column: df.drop('Age', axis=1) will remove the Age column.
 Returns a new DataFrame without the 'Age' column.
If you want to update df, you need:
df = df.drop('Age', axis=1)
or 
df.drop('Age', axis=1, inplace=True)

axis=0 → move down the table → affects rows

axis=1 → move across the table → affects columns

df.drop('Age', axis=0)
this is incorrect 
KeyError: "['Age'] not found in axis"

axis=0 means you're trying to drop a row — pandas expects row labels (i.e., index values like 0, 1, 2...), not column names.

'Age' is a column, not a row index, so it fails.

correct usage : df.drop(2, axis=0)
would drop row with index 2

In [4]:
df

      Name  Age Grade
0    Alice   22     A
1      Bob   23     B
2  Charlie   22     A
3    David   24     C

In [6]:
print(df)

      Name  Age Grade
0    Alice   22     A
1      Bob   23     B
2  Charlie   22     A
3    David   24     C

In [18]:
df.head()

      Name  Age Grade
0    Alice   22     A
1      Bob   23     B
2  Charlie   22     A
3    David   24     C

In [22]:
df.tail(2)

      Name  Age Grade
2  Charlie   22     A
3    David   24     C

In [24]:
df.shape

(4, 3)

In [26]:
df.describe()
# would do it for numeric columns, here age
# What about non-numeric columns like Name and Grade?
# By default, describe() skips them.
# Use df.describe(include='all') to include all columns, including strings

# std dev = /(sigma((xi - xbar)^2)/n-1)


# 25th Percentile (Q1)
# This is the value at 25% of the way through the sorted list.

# ### 🔹 25th Percentile (Q1)

# Step-by-step:

# Position = (n - 1) × 0.25
#          = (4 - 1) × 0.25
#          = 3 × 0.25
#      = 0.75

# So, look between the **0th and 1st** values in the sorted list:  
# → 0th = 22, 1st = 22

# Interpolate:

# Q1 = 22 + 0.75 × (22 - 22)
#    = 22 + 0
#    = 22.0

# ✅ 25% = **22.0**

# ### 🔹 75th Percentile (Q3)

# Step-by-step:

# Position = (n - 1) × 0.75
#          = 3 × 0.75
#          = 2.25

# So, look between the **2nd and 3rd** values:  
# → 2nd = 23, 3rd = 24

# Interpolate:

# Q3 = 23 + 0.25 × (24 - 23)
#    = 23 + 0.25
#    = 23.25

             Age
count   4.000000
mean   22.750000
std     0.957427
min    22.000000
25%    22.000000
50%    22.500000
75%    23.250000
max    24.000000

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Grade   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [5]:
print(df.dtypes)

# Explanation:
# Name → object
# Because it's a column of strings (names), and in pandas, string data is usually stored as object dtype.

# Age → int64
# It's a column of integers, so pandas stores it as 64-bit integers.

Name     object
Age       int64
Grade    object
dtype: object

In [81]:
df.size
#total number of elements

12

In [83]:
 df.ndim # : to check 1d, 2d ... i.e n dimensions

2

In [30]:
df.isnull()

    Name    Age  Grade
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [75]:
df.isnull().sum()

Name     0
Age      0
Grade    0
dtype: int64

In [77]:
df.notnull()

   Name   Age  Grade
0  True  True   True
1  True  True   True
2  True  True   True
3  True  True   True

In [79]:
df.notnull().sum()

Name     4
Age      4
Grade    4
dtype: int64

In [32]:
frame1=df.copy()

In [34]:
frame1

      Name  Age Grade
0    Alice   22     A
1      Bob   23     B
2  Charlie   22     A
3    David   24     C

In [36]:
frame1.isnull().sum

<bound method DataFrame.sum of     Name    Age  Grade
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False>

In [38]:
frame1.isnull().sum()

Name     0
Age      0
Grade    0
dtype: int64

In [50]:
# Add NaN to some values
frame1.loc[1, 'Age'] = np.nan  # Add NaN to Bob's Age
frame1.loc[3, 'Grade'] = np.nan  # Add NaN to David's Grade
print("Updated DataFrame:")
print(frame1)

Updated DataFrame:
      Name   Age Grade
0    Alice  22.0     A
1      Bob   NaN     B
2  Charlie  22.0     A
3    David  24.0   NaN

In [52]:
# Check sum of all NaN values
nan_sum = frame1.isnull().sum()

print("\nSum of all NaN values in each column:")
print(nan_sum)

Sum of all NaN values in each column:
Name     0
Age      1
Grade    1
dtype: int64

In [ ]:
# | Axis | Refers to     | Direction         | Example Use Case               |
# |------|----------------|-------------------|--------------------------------|
# | 0    | **Rows**       | Top to bottom ↓   | Dropping rows, summing columns |
# | 1    | **Columns**    | Left to right →   | Dropping columns, summing rows |

In [54]:
# Sum of NaN values by column (default is axis=0)
nan_sum_by_column = frame1.isnull().sum(axis=0)
print("\nSum of NaN values by column:")
print(nan_sum_by_column)

Sum of NaN values by column:
Name     0
Age      1
Grade    1
dtype: int64

In [56]:
# Sum of NaN values by row
nan_sum_by_row = frame1.isnull().sum(axis=1)
print("\nSum of NaN values by row:")
print(nan_sum_by_row)

Sum of NaN values by row:
0    0
1    1
2    0
3    1
dtype: int64

In [58]:
frame1

      Name   Age Grade
0    Alice  22.0     A
1      Bob   NaN     B
2  Charlie  22.0     A
3    David  24.0   NaN

np.nan stands for "Not a Number" and is used in NumPy to represent missing or undefined values, typically in datasets. It’s a special floating-point value that is part of the IEEE 754 standard for floating-point arithmetic.

In Pandas, when you have missing values in your DataFrame, they are often represented as NaN.

Key Points about np.nan:
Represents Missing Data: np.nan is used to signify that a value is missing or undefined. For example, when you're working with a dataset and some entries are blank, Pandas will use NaN to represent those missing values.

Doesn't Equal Anything:

NaN is not equal to NaN. This is a key point in handling missing values.

So, if you compare np.nan == np.nan, it will return False.

To check if a value is NaN, you should use the function np.isnan().

Use in DataFrames: Pandas will often use NaN to represent missing data in numerical columns, for example:

df['column_name'] = [1, 2, np.nan, 4]

In [64]:

print(frame1.isnull())

    Name    Age  Grade
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False   True

In [68]:
print(frame1.isna())

    Name    Age  Grade
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False   True

In [70]:
frame1_filled = frame1.fillna(0)  # Replace NaN with 0
print(frame1_filled)

      Name   Age Grade
0    Alice  22.0     A
1      Bob   0.0     B
2  Charlie  22.0     A
3    David  24.0     0

In [72]:
frame1_dropped = frame1.dropna()  # Drops rows containing NaN
print(frame1_dropped)

#fillna and dropna are pandas methods

      Name   Age Grade
0    Alice  22.0     A
2  Charlie  22.0     A

In Pandas, NA refers to Not Available or missing data. It is an alternate term used to represent missing or undefined values in a DataFrame, similar to NaN (Not a Number).

Key Points:
NA vs NaN:

NaN: Used mainly to represent missing numeric data. It is part of the IEEE 754 standard for floating-point arithmetic.

NA: Is more general and can be used for any kind of missing data, not just numeric, and is used in certain data structures like Pandas' NA type (since version 1.0).

Pandas NA:

NA is a Pandas-specific object (introduced in Pandas version 1.0) that represents missing data in any type of column (numeric, string, boolean, etc.).

It is similar to np.nan but can be more versatile because it can be used with non-numeric data types (like strings or booleans) as well.

When to use NA:

When you're working with missing values in non-numeric data types, NA is preferred over NaN because NaN works best with numeric columns.

NA can also be used in conjunction with pandas' extension types (like string dtype).

Key Differences:

Aspect	NaN (NumPy)	NA (Pandas)
Library	NumPy	Pandas
Type of Data	Numerical (float)	Can be used for any data type
Missing Value	Used for numeric data	Used for any type of data
Representation	np.nan	pd.NA
Handling in Operations	Works well with numeric operations (math)	More consistent with non-numeric operations
Default Behavior	Part of the IEEE 754 standard for floating-point operations	A general missing value representation in Pandas

isnull() and isna() are interchangeable.

They both return a boolean DataFrame or Series, where True indicates missing values (e.g., NaN, None, or NA).

You can use either function based on your personal preference or consistency in the code, as there is no functional difference.

    Why Two Functions?
Consistency with R: The function isna() is inspired by R, which also uses NA to represent missing values. Pandas added isna() to maintain consistency.

Legacy reasons: isnull() was the original function to detect missing values in Pandas, and isna() was introduced later for convenience and to align with naming conventions from other languages like R.

pd.NaT : not a time
pd.Timestamp('1939-05-27')

Usage : data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'JoinDate': [pd.Timestamp('2020-01-15'), pd.NaT, pd.Timestamp('2021-07-30')]
}

 Summary:
pd.NaT is used for missing datetime.

pd.Timestamp() is used to create or compare specific dates.

You can use these in operations like filtering, filling, or sorting date columns.

df['JoinDate'] = df['JoinDate'].fillna(pd.Timestamp('2000-01-01'))

df_no_missing = df.dropna(subset=['JoinDate'])

# Get rows where JoinDate is after Jan 1, 2021
df_recent = df[df['JoinDate'] > pd.Timestamp('2021-01-01')]